import joblib
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.neighbors import KNeighborsClassifier

# Пример тренировочных фраз для каждой команды
train_data = [
    # -----chat-----
    ("как дела", "chat"),
    ("что делаешь", "chat"),
    ("расскажи что-нибудь", "chat"),
    # -----say_time-----
    ("Сколько сейчас времени", "say_time"),
    ("Который час", "say_time"),
    ("Можешь сказать время", "say_time"),
    ("Подскажи текущее время", "say_time"),
    ("Какое сейчас время", "say_time"),
    ("Скажи мне время", "say_time"),
    ("Время, пожалуйста", "say_time"),
    ("Скажи текущее время", "say_time"),
    ("Можешь сказать, который час", "say_time"),
    ("Подскажи, сколько времени", "say_time"),
    ("Скажи, сколько сейчас времени", "say_time"),
    ("Какое время на часах", "say_time"),
    ("Сколько времени", "say_time"),
    ("Который час сейчас", "say_time"),
    ("Скажи, сколько времени сейчас", "say_time"),
    ("Можешь сказать текущее время", "say_time"),
    ("Скажи, что показывает часы", "say_time"),
    ("Сколько на часах", "say_time"),
    ("Какое время сейчас", "say_time"),
    # ----------
    # -----set_alarm-----
    ("Установи будильник на 7 утра завтра", "set_alarm"),
    ("Поставь будильник на 6:30 утра в понедельник", "set_alarm"),
    ("Напомни мне проснуться в 8 часов в субботу", "set_alarm"),
    ("Заведи будильник на 7:45 утра на 15 сентября", "set_alarm"),
    ("Установи будильник на 5 утра каждое буднее утро", "set_alarm"),
    ("Поставь будильник на 9 утра через два дня", "set_alarm"),
    ("Напомни мне проснуться в 6:15 в воскресенье", "set_alarm"),
    ("Заведи будильник на 7 утра на следующую неделю", "set_alarm"),
    ("Установи будильник на 8:30 утра на среду", "set_alarm"),
    ("Поставь будильник на 6 утра каждую пятницу", "set_alarm"),
    ("Напомни мне встать в 7:30 завтра утром", "set_alarm"),
    ("Заведи будильник на 8 часов на 1 октября", "set_alarm"),
    ("Установи будильник на 7 утра каждое утро", "set_alarm"),
    ("Поставь будильник на 6:45 утра на 10 декабря", "set_alarm"),
    ("Напомни мне проснуться в 9 утра на выходных", "set_alarm"),
    ("Заведи будильник на 5:30 утра на понедельник", "set_alarm"),
    ("Установи будильник на 7:15 утра на следующую среду", "set_alarm"),
    ("Поставь будильник на 8 утра каждый вторник", "set_alarm"),
    ("Напомни мне проснуться в 7:45 завтра", "set_alarm"),
    # ----------
    # -----stop_alarm-----
    ("Останови будильник", "stop_alarm"),
    ("Выключи будильник", "stop_alarm"),
    ("Отмени будильник", "stop_alarm"),
    ("Прекрати будильник", "stop_alarm"),
    ("Убери будильник", "stop_alarm"),
    ("Отключи будильник", "stop_alarm"),
    ("Заверши будильник", "stop_alarm"),
    ("Сними будильник", "stop_alarm"),
    ("Деактивируй будильник", "stop_alarm"),
    ("Успокой будильник", "stop_alarm"),
    ("Замолчи будильник", "stop_alarm"),
    ("Заткни будильник", "stop_alarm"),
    ("Сбрось будильник", "stop_alarm"),
    ("Стоп будильник", "stop_alarm"),
    ("Стоп сигнал", "stop_alarm"),
    ("Останови сигнал", "stop_alarm"),
    ("Прекрати сигнал", "stop_alarm"),
    ("Выключи сигнал", "stop_alarm"),
    ("Отмени сигнал", "stop_alarm"),
    # ----------
    # -----delete_alarm-----
    ("Удали будильник на 7 утра завтра", "delete_alarm"),
    ("Убери будильник на 6:30 утра в понедельник", "delete_alarm"),
    ("Отмени будильник на 8 часов в субботу", "delete_alarm"),
    ("Удали будильник на 7:45 утра на 15 сентября", "delete_alarm"),
    ("Сотри будильник на 5 утра каждое буднее утро", "delete_alarm"),
    ("Убери будильник на 9 утра через два дня", "delete_alarm"),
    ("Отмени будильник на 6:15 в воскресенье", "delete_alarm"),
    ("Удали будильник на 7 утра на следующую неделю", "delete_alarm"),
    ("Убери будильник на 8:30 утра на среду", "delete_alarm"),
    ("Отмени будильник на 6 утра каждую пятницу", "delete_alarm"),
    ("Сотри будильник на 7:30 завтра утром", "delete_alarm"),
    ("Удали будильник на 8 часов на 1 октября", "delete_alarm"),
    ("Убери будильник на 7 утра каждое утро", "delete_alarm"),
    ("Отмени будильник на 6:45 утра на 10 декабря", "delete_alarm"),
    ("Сотри будильник на 9 утра на выходных", "delete_alarm"),
    ("Удали будильник на 5:30 утра на понедельник", "delete_alarm"),
    ("Убери будильник на 7:15 утра на следующую среду", "delete_alarm"),
    ("Отмени будильник на 8 утра каждый вторник", "delete_alarm"),
    ("Сотри будильник на 7:45 завтра", "delete_alarm"),
    # ----------
    # -----change_alarm-----
    ("Измени будильник с 7 утра на 8 утра завтра", "change_alarm"),
    ("Поменяй будильник на 6:30 утра в понедельник", "change_alarm"),
    ("Перенеси будильник на 8 часов в субботу", "change_alarm"),
    ("Измени будильник с 7:45 утра на 15 сентября на 8:45 утра", "change_alarm"),
    ("Поменяй будильник на 5 утра на каждый будний день", "change_alarm"),
    ("Перенеси будильник с 9 утра на 10 утра через два дня", "change_alarm"),
    ("Измени будильник на 6:15 в воскресенье на 7:15", "change_alarm"),
    ("Поменяй будильник с 7 утра на следующую неделю на 8 утра", "change_alarm"),
    ("Перенеси будильник на 8:30 утра в среду на 9:30", "change_alarm"),
    ("Измени будильник на 6 утра каждую пятницу на 7 утра", "change_alarm"),
    ("Поменяй будильник с 7:30 утра на завтра на 8:30 утра", "change_alarm"),
    ("Перенеси будильник на 8 часов на 1 октября на 9 часов", "change_alarm"),
    ("Измени будильник с 7 утра каждое утро на 8 утра", "change_alarm"),
    ("Поменяй будильник на 6:45 утра на 10 декабря на 7:45 утра", "change_alarm"),
    ("Перенеси будильник с 9 утра на выходных на 10 утра", "change_alarm"),
    ("Измени будильник на 5:30 утра на понедельник на 6:30 утра", "change_alarm"),
    ("Поменяй будильник с 7:15 утра на следующую среду на 8:15 утра", "change_alarm"),
    ("Перенеси будильник на 8 утра каждый вторник на 9 утра", "change_alarm"),
    ("Измени будильник с 7:45 на завтра на 8:45 утра", "change_alarm"),
    # ----------
    # -----say_alarms-----
    ("Какие у меня установлены будильники", "say_alarms"),
    ("Покажи мои будильники", "say_alarms"),
    ("Скажи все будильники", "say_alarms"),
    ("Какие будильники у меня есть", "say_alarms"),
    ("Озвучь мои будильники", "say_alarms"),
    ("Какие будильники настроены", "say_alarms"),
    ("Какие будильники сейчас активны", "say_alarms"),
    ("Перечисли мои будильники", "say_alarms"),
    ("Назови все будильники", "say_alarms"),
    ("Какие будильники установлены", "say_alarms"),
    ("Покажи все настроенные будильники", "say_alarms"),
    ("Какие у меня есть будильники", "say_alarms"),
    ("Скажи, какие будильники у меня есть", "say_alarms"),
    ("Какие будильники заданы", "say_alarms"),
    ("Какие будильники сейчас установлены", "say_alarms"),
    ("Скажи мои текущие будильники", "say_alarms"),
    ("Перечисли все установленные будильники", "say_alarms"),
    ("Какие будильники у меня настроены", "say_alarms"),
    ("Озвучь все мои будильники", "say_alarms"),
    # ----------
    # -----start_stopwhatch-----
    ("Запусти секундомер", "start_stopwhatch"),
    ("Начни отсчет времени", "start_stopwhatch"),
    ("Включи секундомер", "start_stopwhatch"),
    ("Начни измерять время", "start_stopwhatch"),
    ("Поставь секундомер", "start_stopwhatch"),
    ("Запусти отсчет", "start_stopwhatch"),
    ("Начни отсчет", "start_stopwhatch"),
    ("Включи отсчет времени", "start_stopwhatch"),
    ("Запусти хронометраж", "start_stopwhatch"),
    ("Начни хронометраж", "start_stopwhatch"),
    ("Включи хронометр", "start_stopwhatch"),
    ("Запусти измерение времени", "start_stopwhatch"),
    ("Начни измерение времени", "start_stopwhatch"),
    ("Включи измерение времени", "start_stopwhatch"),
    ("Стартуй секундомер", "start_stopwhatch"),
    ("Запусти счет времени", "start_stopwhatch"),
    ("Начни счет времени", "start_stopwhatch"),
    ("Включи счет времени", "start_stopwhatch"),
    ("Начни фиксировать время", "start_stopwhatch"),
    # ----------
    # -----stop_stopwhatch-----
    ("Останови секундомер", "stop_stopwhatch"),
    ("Прекрати отсчет времени", "stop_stopwhatch"),
    ("Заверши хронометраж", "stop_stopwhatch"),
    ("Выключи секундомер", "stop_stopwhatch"),
    ("Сбрось секундомер", "stop_stopwhatch"),
    ("Останови измерение времени", "stop_stopwhatch"),
    ("Прекрати фиксировать время", "stop_stopwhatch"),
    ("Заверши учет времени", "stop_stopwhatch"),
    ("Прекрати хронометрирование", "stop_stopwhatch"),
    ("Останови счет времени", "stop_stopwhatch"),
    ("Прекрати фиксацию времени", "stop_stopwhatch"),
    ("Заверши измерение времени", "stop_stopwhatch"),
    ("Заверши отсчет", "stop_stopwhatch"),
    ("Останови хронометрирование", "stop_stopwhatch"),
    ("Стоп хронометраж", "stop_stopwhatch"),
    ("Заверши хронометрирование", "stop_stopwhatch"),
    ("Прекрати учет времени", "stop_stopwhatch"),
    ("Останови хронометр", "stop_stopwhatch"),
    ("Выключи счет времени", "stop_stopwhatch"),
    # ----------
    # -----stop_timer-----
    ("Останови таймер", "stop_timer"),
    ("Выключи таймер", "stop_timer"),
    ("Прекрати таймер", "stop_timer"),
    ("Отмени таймер", "stop_timer"),
    ("Заверши таймер", "stop_timer"),
    ("Отключи таймер", "stop_timer"),
    ("Сбрось таймер", "stop_timer"),
    ("Стоп таймер", "stop_timer"),
    ("Прерви таймер", "stop_timer"),
    ("Убери таймер", "stop_timer"),
    ("Стоп сигнал", "stop_timer"),
    ("Прекрати сигнал", "stop_timer"),
    ("Выключи сигнал", "stop_timer"),
    ("Отмени сигнал", "stop_timer"),
    ("Стоп отсчёт", "stop_timer"),
    ("Заверши отсчёт", "stop_timer"),
    ("Прекрати отсчёт", "stop_timer"),
    ("Останови отсчёт", "stop_timer"),
    ("Сбрось отсчёт", "stop_timer"),
    # ----------
]

# Разделение данных на тренировочные фразы и соответствующие команды
train_phrases, train_labels = zip(*train_data)

# Векторизация текстовых данных
vectorizer = CountVectorizer()
X_train = vectorizer.fit_transform(train_phrases)

# Обучение модели k-NN
knn = KNeighborsClassifier(n_neighbors=1)
knn.fit(X_train, train_labels)

# Сохранение модели и векторизатора
joblib.dump(vectorizer, 'vectorizer.joblib')
joblib.dump(knn, 'knn_model.joblib')

print("Модель и векторизатор успешно сохранены.")
